class GamePlay {
    //Создаем таблицу игры, представляем игроков
    // и подставляем всё в gametable
    fun greetings() {
        var gametable = GameTable.GameTable()
    }
    //TODO раздаем карты игрокам помечаем козыря
    //TODO каждый из игроков проверяет полученные карты и в случае если не удовлетворен раздачей просит пересдать
    //TODO Кон игры(повторяем 4 раза, по количеству наличествующих карт)
    //TODO Подсчитываем очки у игроков
    //TODO подсчитываем общее число очков подводим итоги игры
    //TODO
    //TODO
    //TODO
    //TODO
    //TODO
    //TODO
}